---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.IsSavedInCurrentVersion
source: html/d68e377e-690c-0893-f505-003bf3634de5.htm
---
# Autodesk.Revit.DB.BasicFileInfo.IsSavedInCurrentVersion Property

Checks if the file is saved in the current version.

## Syntax (C#)
```csharp
public bool IsSavedInCurrentVersion { get; }
```